In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
sns.set_palette("muted")
import matplotlib.pyplot as plt

In [2]:
date=pd.read_csv("dim_date.csv")

In [3]:
date.shape

(92, 4)

In [4]:
date.head()

        date  mmm yy week no  day_type
0  01-May-22  May 22    W 19   weekend
1  02-May-22  May 22    W 19  weekeday
2  03-May-22  May 22    W 19  weekeday
3  04-May-22  May 22    W 19  weekeday
4  05-May-22  May 22    W 19  weekeday

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      92 non-null     object
 1   mmm yy    92 non-null     object
 2   week no   92 non-null     object
 3   day_type  92 non-null     object
dtypes: object(4)
memory usage: 3.0+ KB

In [6]:
date.isna().sum()

date        0
mmm yy      0
week no     0
day_type    0
dtype: int64

In [7]:
hotel=pd.read_csv("dim_hotels.csv")

In [8]:
hotel.shape

(25, 4)

In [9]:
hotel.head()

   property_id  property_name  category    city
0        16558   Atliq Grands    Luxury   Delhi
1        16559  Atliq Exotica    Luxury  Mumbai
2        16560     Atliq City  Business   Delhi
3        16561      Atliq Blu    Luxury   Delhi
4        16562      Atliq Bay    Luxury   Delhi

In [10]:
hotel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_id    25 non-null     int64
 1   property_name  25 non-null     object
 2   category       25 non-null     object
 3   city           25 non-null     object
dtypes: int64(1), object(3)
memory usage: 928.0+ bytes

In [11]:
hotel.isna().sum()

property_id      0
property_name    0
category         0
city             0
dtype: int64

In [12]:
room=pd.read_csv("dim_rooms.csv")

In [13]:
room.shape

(4, 2)

In [14]:
room.head()

  room_id    room_class
0     RT1      Standard
1     RT2         Elite
2     RT3       Premium
3     RT4  Presidential

In [15]:
room.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   room_id     4 non-null      object
 1   room_class  4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [16]:
room.isna().sum()

room_id       0
room_class    0
dtype: int64

In [17]:
agbookings=pd.read_csv("fact_aggregated_bookings.csv")

In [18]:
agbookings.shape

(9200, 5)

In [19]:
agbookings.head()

   property_id check_in_date room_category  successful_bookings  capacity
0        16559      1-May-22           RT1                   25      30.0
1        19562      1-May-22           RT1                   28      30.0
2        19563      1-May-22           RT1                   23      30.0
3        17558      1-May-22           RT1                   30      19.0
4        16558      1-May-22           RT1                   18      19.0

In [20]:
agbookings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9200 entries, 0 to 9199
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_id          9200 non-null   int64
 1   check_in_date        9200 non-null   object
 2   room_category        9200 non-null   object
 3   successful_bookings  9200 non-null   int64
 4   capacity             9198 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 359.5+ KB

In [21]:
agbookings.isna().sum()

property_id            0
check_in_date          0
room_category          0
successful_bookings    0
capacity               2
dtype: int64

In [22]:
agbookings.drop("capacity",axis=1)

      property_id check_in_date room_category  successful_bookings
0           16559      1-May-22           RT1                   25
1           19562      1-May-22           RT1                   28
2           19563      1-May-22           RT1                   23
3           17558      1-May-22           RT1                   30
4           16558      1-May-22           RT1                   18
...           ...           ...           ...                  ...
9195        16563     31-Jul-22           RT4                   13
9196        16559     31-Jul-22           RT4                   13
9197        17558     31-Jul-22           RT4                    3
9198        19563     31-Jul-22           RT4                    3
9199        17561     31-Jul-22           RT4                    3

[9200 rows x 4 columns]

In [23]:
agbookings.isna().sum()

property_id            0
check_in_date          0
room_category          0
successful_bookings    0
capacity               2
dtype: int64

In [24]:
bookings=pd.read_csv("fact_bookings.csv")

In [25]:
bookings.shape

(134590, 12)

In [26]:
bookings.head()

,booking_id,property_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,ratings_given,booking_status,revenue_generated,revenue_realized
0,May012216558RT11,16558,27-04-22,1/5/2022,2/5/2022,-3.0,RT1,direct online,1.0,Checked Out,10010,10010
1,May012216558RT12,16558,30-04-22,1/5/2022,2/5/2022,2.0,RT1,others,NaN,Cancelled,9100,3640
2,May012216558RT13,16558,28-04-22,1/5/2022,4/5/2022,2.0,RT1,logtrip,5.0,Checked Out,9100000,9100
3,May012216558RT14,16558,28-04-22,1/5/2022,2/5/2022,-2.0,RT1,others,NaN,Cancelled,9100,3640
4,May012216558RT15,16558,27-04-22,1/5/2022,2/5/2022,4.0,RT1,direct online,5.0,Checked Out,10920,10920

In [27]:
bookings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   booking_id         134590 non-null  object
 1   property_id        134590 non-null  int64
 2   booking_date       134590 non-null  object
 3   check_in_date      134590 non-null  object
 4   checkout_date      134590 non-null  object
 5   no_guests          134587 non-null  float64
 6   room_category      134590 non-null  object
 7   booking_platform   134590 non-null  object
 8   ratings_given      56683 non-null   float64
 9   booking_status     134590 non-null  object
 10  revenue_generated  134590 non-null  int64
 11  revenue_realized   134590 non-null  int64
dtypes: float64(2), int64(3), object(7)
memory usage: 12.3+ MB

In [28]:
bookings.isna().sum()

booking_id               0
property_id              0
booking_date             0
check_in_date            0
checkout_date            0
no_guests                3
room_category            0
booking_platform         0
ratings_given        77907
booking_status           0
revenue_generated        0
revenue_realized         0
dtype: int64

In [29]:
bookings.drop("ratings_given",axis=1,inplace=True)

In [30]:
# Find out days on which bookings are greater then the capacity

agbookings[agbookings.successful_bookings > agbookings.capacity]

      property_id check_in_date room_category  successful_bookings  capacity
3           17558      1-May-22           RT1                   30      19.0
12          16563      1-May-22           RT1                  100      41.0
4136        19558     11-Jun-22           RT2                   50      39.0
6209        19560      2-Jul-22           RT1                  123      26.0
8522        19559     25-Jul-22           RT1                   35      24.0
9194        18563     31-Jul-22           RT4                   20      18.0

In [31]:
# Find out the properties that have the highest capactity

agbookings.capacity.max()

50.0

In [32]:
agbookings[agbookings.capacity==agbookings.capacity.max()]

      property_id check_in_date room_category  successful_bookings  capacity
27          17558      1-May-22           RT2                   38      50.0
128         17558      2-May-22           RT2                   27      50.0
229         17558      3-May-22           RT2                   26      50.0
328         17558      4-May-22           RT2                   27      50.0
428         17558      5-May-22           RT2                   29      50.0
...           ...           ...           ...                  ...       ...
8728        17558     27-Jul-22           RT2                   22      50.0
8828        17558     28-Jul-22           RT2                   21      50.0
8928        17558     29-Jul-22           RT2                   23      50.0
9028        17558     30-Jul-22           RT2                   32      50.0
9128        17558     31-Jul-22           RT2                   30      50.0

[92 rows x 5 columns]

# Finding the Outliers

In [33]:
# Calculating higher and lower limits

avg,std=bookings.revenue_generated.mean(),bookings.revenue_generated.std()

In [34]:
higher_limit=avg+3*std
higher_limit

294486.1701402605

In [35]:
lower_limit=avg-3*std
lower_limit

-263730.061885561

In [36]:
bookings[bookings.revenue_generated > higher_limit]

,booking_id,property_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,booking_status,revenue_generated,revenue_realized
2,May012216558RT13,16558,28-04-22,1/5/2022,4/5/2022,2.0,RT1,logtrip,Checked Out,9100000,9100
111,May012216559RT32,16559,29-04-22,1/5/2022,2/5/2022,6.0,RT3,direct online,Checked Out,28560000,28560
315,May012216562RT22,16562,28-04-22,1/5/2022,4/5/2022,2.0,RT2,direct offline,Checked Out,12600000,12600
562,May012217559RT118,17559,26-04-22,1/5/2022,2/5/2022,2.0,RT1,others,Cancelled,2000000,4420
129176,Jul282216562RT26,16562,21-07-22,28-07-22,29-07-22,2.0,RT2,direct online,Checked Out,10000000,12600

In [37]:
bookings=bookings[bookings.revenue_generated <= higher_limit]
bookings.shape

(134585, 11)

In [38]:
# Finding the null values in Aggregate Bookings and replacing them with mean or median value

agbookings.isna().sum()

property_id            0
check_in_date          0
room_category          0
successful_bookings    0
capacity               2
dtype: int64

In [39]:
agbookings.capacity.mean()

25.280495759947815

In [40]:
agbookings.capacity.median()

25.0

In [41]:
# here median value is more appropriate to be filled in to the dataset as it is a whole number

agbookings.capacity.fillna(agbookings.capacity.median(),inplace=True)

In [42]:
agbookings.isna().sum()

property_id            0
check_in_date          0
room_category          0
successful_bookings    0
capacity               0
dtype: int64

In [47]:
# Adding a new column to the eisting dataset 'occ_pct'

agbookings['occ_pct'] = agbookings.apply(lambda row: row['successful_bookings'] / row['capacity'], axis=1)

In [45]:
new_col = agbookings.apply(lambda row : row['successful_bookings'] / row['capacity'], axis=1)
agbookings = agbookings.assign(occ_pct=new_col.values)
agbookings.head()

,property_id,check_in_date,room_category,successful_bookings,capacity,occ_pct
0,16559,1-May-22,RT1,25,30.0,0.833333
1,19562,1-May-22,RT1,28,30.0,0.933333
2,19563,1-May-22,RT1,23,30.0,0.766667
3,17558,1-May-22,RT1,30,19.0,1.578947
4,16558,1-May-22,RT1,18,19.0,0.947368

In [48]:
agbookings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9200 entries, 0 to 9199
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_id          9200 non-null   int64
 1   check_in_date        9200 non-null   object
 2   room_category        9200 non-null   object
 3   successful_bookings  9200 non-null   int64
 4   capacity             9200 non-null   float64
 5   occ_pct              9200 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 431.4+ KB